#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

use std::ptr;
use core::slice;
use std::collections::HashMap;

/* automatically generated by rust-bindgen 0.59.2 */

pub const PKCS11_H: u32 = 1;
pub const CRYPTOKI_VERSION_MAJOR: u32 = 2;
pub const CRYPTOKI_VERSION_MINOR: u32 = 40;
pub const CRYPTOKI_VERSION_REVISION: u32 = 0;
pub const CRYPTOKI_COMPAT: u32 = 1;
pub const CKN_SURRENDER: u32 = 0;
pub const CKF_TOKEN_PRESENT: u32 = 1;
pub const CKF_REMOVABLE_DEVICE: u32 = 2;
pub const CKF_HW_SLOT: u32 = 4;
pub const CKF_ARRAY_ATTRIBUTE: u32 = 1073741824;
pub const CKF_RNG: u32 = 1;
pub const CKF_WRITE_PROTECTED: u32 = 2;
pub const CKF_LOGIN_REQUIRED: u32 = 4;
pub const CKF_USER_PIN_INITIALIZED: u32 = 8;
pub const CKF_RESTORE_KEY_NOT_NEEDED: u32 = 32;
pub const CKF_CLOCK_ON_TOKEN: u32 = 64;
pub const CKF_PROTECTED_AUTHENTICATION_PATH: u32 = 256;
pub const CKF_DUAL_CRYPTO_OPERATIONS: u32 = 512;
pub const CKF_TOKEN_INITIALIZED: u32 = 1024;
pub const CKF_SECONDARY_AUTHENTICATION: u32 = 2048;
pub const CKF_USER_PIN_COUNT_LOW: u32 = 65536;
pub const CKF_USER_PIN_FINAL_TRY: u32 = 131072;
pub const CKF_USER_PIN_LOCKED: u32 = 262144;
pub const CKF_USER_PIN_TO_BE_CHANGED: u32 = 524288;
pub const CKF_SO_PIN_COUNT_LOW: u32 = 1048576;
pub const CKF_SO_PIN_FINAL_TRY: u32 = 2097152;
pub const CKF_SO_PIN_LOCKED: u32 = 4194304;
pub const CKF_SO_PIN_TO_BE_CHANGED: u32 = 8388608;
pub const CK_EFFECTIVELY_INFINITE: u32 = 0;
pub const CK_INVALID_HANDLE: u32 = 0;
pub const CKU_SO: u32 = 0;

pub const CKR_KEY_NOT_WRAPPABLE: u32 = 105;
pub const CKR_KEY_UNEXTRACTABLE: u32 = 106;
pub const CKR_MECHANISM_INVALID: u32 = 112;
pub const CKR_MECHANISM_PARAM_INVALID: u32 = 113;
pub const CKR_OBJECT_HANDLE_INVALID: u32 = 130;
pub const CKR_OPERATION_ACTIVE: u32 = 144;
pub const CKR_OPERATION_NOT_INITIALIZED: u32 = 145;
pub const CKR_PIN_INCORRECT: u32 = 160;
pub const CKR_PIN_INVALID: u32 = 161;
pub const CKR_PIN_LEN_RANGE: u32 = 162;
pub const CKR_PIN_EXPIRED: u32 = 163;
pub const CKR_PIN_LOCKED: u32 = 164;
pub const CKR_SESSION_CLOSED: u32 = 176;
pub const CKR_SESSION_COUNT: u32 = 177;
pub const CKR_SESSION_HANDLE_INVALID: u32 = 179;
pub const CKR_SESSION_PARALLEL_NOT_SUPPORTED: u32 = 180;
pub const CKR_SESSION_READ_ONLY: u32 = 181;
pub const CKR_SESSION_EXISTS: u32 = 182;
pub const CKR_SESSION_READ_ONLY_EXISTS: u32 = 183;
pub const CKR_SESSION_READ_WRITE_SO_EXISTS: u32 = 184;
pub const CKR_SIGNATURE_INVALID: u32 = 192;
pub const CKR_SIGNATURE_LEN_RANGE: u32 = 193;
pub const CKR_TEMPLATE_INCOMPLETE: u32 = 208;
pub const CKR_TEMPLATE_INCONSISTENT: u32 = 209;
pub const CKR_TOKEN_NOT_PRESENT: u32 = 224;
pub const CKR_TOKEN_NOT_RECOGNIZED: u32 = 225;
pub const CKR_TOKEN_WRITE_PROTECTED: u32 = 226;
pub const CKR_UNWRAPPING_KEY_HANDLE_INVALID: u32 = 240;
pub const CKR_UNWRAPPING_KEY_SIZE_RANGE: u32 = 241;
pub const CKR_UNWRAPPING_KEY_TYPE_INCONSISTENT: u32 = 242;
pub const CKR_USER_ALREADY_LOGGED_IN: u32 = 256;
pub const CKR_USER_NOT_LOGGED_IN: u32 = 257;
pub const CKR_USER_PIN_NOT_INITIALIZED: u32 = 258;
pub const CKR_USER_TYPE_INVALID: u32 = 259;
pub const CKR_USER_ANOTHER_ALREADY_LOGGED_IN: u32 = 260;
pub const CKR_USER_TOO_MANY_TYPES: u32 = 261;
pub const CKR_WRAPPED_KEY_INVALID: u32 = 272;
pub const CKR_WRAPPED_KEY_LEN_RANGE: u32 = 274;
pub const CKR_WRAPPING_KEY_HANDLE_INVALID: u32 = 275;
pub const CKR_WRAPPING_KEY_SIZE_RANGE: u32 = 276;
pub const CKR_WRAPPING_KEY_TYPE_INCONSISTENT: u32 = 277;
pub const CKR_RANDOM_SEED_NOT_SUPPORTED: u32 = 288;
pub const CKR_RANDOM_NO_RNG: u32 = 289;
pub const CKR_DOMAIN_PARAMS_INVALID: u32 = 304;
pub const CKR_CURVE_NOT_SUPPORTED: u32 = 320;
pub const CKR_BUFFER_TOO_SMALL: u32 = 336;
pub const CKR_SAVED_STATE_INVALID: u32 = 352;
pub const CKR_INFORMATION_SENSITIVE: u32 = 368;
pub const CKR_STATE_UNSAVEABLE: u32 = 384;
pub const CKR_CRYPTOKI_NOT_INITIALIZED: u32 = 400;
pub const CKR_CRYPTOKI_ALREADY_INITIALIZED: u32 = 401;
pub const CKR_MUTEX_BAD: u32 = 416;
pub const CKR_MUTEX_NOT_LOCKED: u32 = 417;
pub const CKR_FUNCTION_REJECTED: u32 = 512;
pub const CKR_VENDOR_DEFINED: u32 = 2147483648;
pub const CK_FALSE: u32 = 0;
pub const CK_TRUE: u32 = 1;
pub const FALSE: u32 = 0;
pub const TRUE: u32 = 1;
pub type CK_FLAGS = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone, Default)]
pub struct _CK_VERSION {
    pub major: ::std::os::raw::c_uchar,
    pub minor: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout__CK_VERSION() {
    assert_eq!(
        ::std::mem::size_of::<_CK_VERSION>(),
        2usize,
        concat!("Size of: ", stringify!(_CK_VERSION))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_VERSION>(),
        1usize,
        concat!("Alignment of ", stringify!(_CK_VERSION))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_VERSION>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_VERSION),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_VERSION>())).minor as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_VERSION),
            "::",
            stringify!(minor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_INFO {
    pub cryptokiVersion: _CK_VERSION,
    pub manufacturerID: [::std::os::raw::c_uchar; 32usize],
    pub flags: CK_FLAGS,
    pub libraryDescription: [::std::os::raw::c_uchar; 32usize],
    pub libraryVersion: _CK_VERSION,
}
#[test]
fn bindgen_test_layout__CK_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_CK_INFO>(),
        88usize,
        concat!("Size of: ", stringify!(_CK_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_INFO>())).cryptokiVersion as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_INFO),
            "::",
            stringify!(cryptokiVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_INFO>())).manufacturerID as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_INFO),
            "::",
            stringify!(manufacturerID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_INFO>())).flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_INFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_INFO>())).libraryDescription as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_INFO),
            "::",
            stringify!(libraryDescription)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_INFO>())).libraryVersion as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_INFO),
            "::",
            stringify!(libraryVersion)
        )
    );
}
pub type CK_NOTIFICATION = ::std::os::raw::c_ulong;
pub type CK_SLOT_ID = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_SLOT_INFO {
    pub slotDescription: [::std::os::raw::c_uchar; 64usize],
    pub manufacturerID: [::std::os::raw::c_uchar; 32usize],
    pub flags: CK_FLAGS,
    pub hardwareVersion: _CK_VERSION,
    pub firmwareVersion: _CK_VERSION,
}
#[test]
fn bindgen_test_layout__CK_SLOT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_CK_SLOT_INFO>(),
        112usize,
        concat!("Size of: ", stringify!(_CK_SLOT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_SLOT_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_SLOT_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SLOT_INFO>())).slotDescription as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SLOT_INFO),
            "::",
            stringify!(slotDescription)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SLOT_INFO>())).manufacturerID as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SLOT_INFO),
            "::",
            stringify!(manufacturerID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SLOT_INFO>())).flags as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SLOT_INFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SLOT_INFO>())).hardwareVersion as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SLOT_INFO),
            "::",
            stringify!(hardwareVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SLOT_INFO>())).firmwareVersion as *const _ as usize },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SLOT_INFO),
            "::",
            stringify!(firmwareVersion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_TOKEN_INFO {
    pub label: [::std::os::raw::c_uchar; 32usize],
    pub manufacturerID: [::std::os::raw::c_uchar; 32usize],
    pub model: [::std::os::raw::c_uchar; 16usize],
    pub serialNumber: [::std::os::raw::c_uchar; 16usize],
    pub flags: CK_FLAGS,
    pub ulMaxSessionCount: ::std::os::raw::c_ulong,
    pub ulSessionCount: ::std::os::raw::c_ulong,
    pub ulMaxRwSessionCount: ::std::os::raw::c_ulong,
    pub ulRwSessionCount: ::std::os::raw::c_ulong,
    pub ulMaxPinLen: ::std::os::raw::c_ulong,
    pub ulMinPinLen: ::std::os::raw::c_ulong,
    pub ulTotalPublicMemory: ::std::os::raw::c_ulong,
    pub ulFreePublicMemory: ::std::os::raw::c_ulong,
    pub ulTotalPrivateMemory: ::std::os::raw::c_ulong,
    pub ulFreePrivateMemory: ::std::os::raw::c_ulong,
    pub hardwareVersion: _CK_VERSION,
    pub firmwareVersion: _CK_VERSION,
    pub utcTime: [::std::os::raw::c_uchar; 16usize],
}
#[test]
fn bindgen_test_layout__CK_TOKEN_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_CK_TOKEN_INFO>(),
        208usize,
        concat!("Size of: ", stringify!(_CK_TOKEN_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_TOKEN_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_TOKEN_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).label as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).manufacturerID as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(manufacturerID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).model as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).serialNumber as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(serialNumber)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).flags as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulMaxSessionCount as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulMaxSessionCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulSessionCount as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulSessionCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulMaxRwSessionCount as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulMaxRwSessionCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulRwSessionCount as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulRwSessionCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulMaxPinLen as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulMaxPinLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulMinPinLen as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulMinPinLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulTotalPublicMemory as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulTotalPublicMemory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulFreePublicMemory as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulFreePublicMemory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulTotalPrivateMemory as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulTotalPrivateMemory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).ulFreePrivateMemory as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(ulFreePrivateMemory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).hardwareVersion as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(hardwareVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).firmwareVersion as *const _ as usize },
        186usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(firmwareVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_TOKEN_INFO>())).utcTime as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_TOKEN_INFO),
            "::",
            stringify!(utcTime)
        )
    );
}
pub type CK_SESSION_HANDLE = ::std::os::raw::c_ulong;
pub type CK_USER_TYPE = ::std::os::raw::c_ulong;
pub type CK_STATE = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_SESSION_INFO {
    pub slotID: CK_SLOT_ID,
    pub state: CK_STATE,
    pub flags: CK_FLAGS,
    pub ulDeviceError: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__CK_SESSION_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_CK_SESSION_INFO>(),
        32usize,
        concat!("Size of: ", stringify!(_CK_SESSION_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_SESSION_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_SESSION_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SESSION_INFO>())).slotID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SESSION_INFO),
            "::",
            stringify!(slotID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SESSION_INFO>())).state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SESSION_INFO),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SESSION_INFO>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SESSION_INFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_SESSION_INFO>())).ulDeviceError as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_SESSION_INFO),
            "::",
            stringify!(ulDeviceError)
        )
    );
}
pub type CK_OBJECT_HANDLE = ::std::os::raw::c_ulong;
pub type CK_OBJECT_CLASS = ::std::os::raw::c_ulong;
pub type CK_HW_FEATURE_TYPE = ::std::os::raw::c_ulong;
pub type CK_KEY_TYPE = ::std::os::raw::c_ulong;
pub type CK_CERTIFICATE_TYPE = ::std::os::raw::c_ulong;
pub type CK_ATTRIBUTE_TYPE = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_ATTRIBUTE {
    pub type_: CK_ATTRIBUTE_TYPE,
    pub pValue: *mut ::std::os::raw::c_void,
    pub ulValueLen: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__CK_ATTRIBUTE() {
    assert_eq!(
        ::std::mem::size_of::<_CK_ATTRIBUTE>(),
        24usize,
        concat!("Size of: ", stringify!(_CK_ATTRIBUTE))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_ATTRIBUTE>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_ATTRIBUTE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_ATTRIBUTE>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_ATTRIBUTE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_ATTRIBUTE>())).pValue as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_ATTRIBUTE),
            "::",
            stringify!(pValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_ATTRIBUTE>())).ulValueLen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_ATTRIBUTE),
            "::",
            stringify!(ulValueLen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_DATE {
    pub year: [::std::os::raw::c_uchar; 4usize],
    pub month: [::std::os::raw::c_uchar; 2usize],
    pub day: [::std::os::raw::c_uchar; 2usize],
}
#[test]
fn bindgen_test_layout__CK_DATE() {
    assert_eq!(
        ::std::mem::size_of::<_CK_DATE>(),
        8usize,
        concat!("Size of: ", stringify!(_CK_DATE))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_DATE>(),
        1usize,
        concat!("Alignment of ", stringify!(_CK_DATE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_DATE>())).year as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_DATE),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_DATE>())).month as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_DATE),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_DATE>())).day as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_DATE),
            "::",
            stringify!(day)
        )
    );
}
pub type CK_MECHANISM_TYPE = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_MECHANISM {
    pub mechanism: CK_MECHANISM_TYPE,
    pub pParameter: *mut ::std::os::raw::c_void,
    pub ulParameterLen: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__CK_MECHANISM() {
    assert_eq!(
        ::std::mem::size_of::<_CK_MECHANISM>(),
        24usize,
        concat!("Size of: ", stringify!(_CK_MECHANISM))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_MECHANISM>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_MECHANISM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM>())).mechanism as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM),
            "::",
            stringify!(mechanism)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM>())).pParameter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM),
            "::",
            stringify!(pParameter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM>())).ulParameterLen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM),
            "::",
            stringify!(ulParameterLen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_MECHANISM_INFO {
    pub ulMinKeySize: ::std::os::raw::c_ulong,
    pub ulMaxKeySize: ::std::os::raw::c_ulong,
    pub flags: CK_FLAGS,
}
#[test]
fn bindgen_test_layout__CK_MECHANISM_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_CK_MECHANISM_INFO>(),
        24usize,
        concat!("Size of: ", stringify!(_CK_MECHANISM_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_MECHANISM_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_MECHANISM_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM_INFO>())).ulMinKeySize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM_INFO),
            "::",
            stringify!(ulMinKeySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM_INFO>())).ulMaxKeySize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM_INFO),
            "::",
            stringify!(ulMaxKeySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_MECHANISM_INFO>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_MECHANISM_INFO),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ECDH1_DERIVE_PARAMS {
    pub kdf: ::std::os::raw::c_ulong,
    pub ulSharedDataLen: ::std::os::raw::c_ulong,
    pub pSharedData: *mut ::std::os::raw::c_uchar,
    pub ulPublicDataLen: ::std::os::raw::c_ulong,
    pub pPublicData: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_CK_ECDH1_DERIVE_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<CK_ECDH1_DERIVE_PARAMS>(),
        40usize,
        concat!("Size of: ", stringify!(CK_ECDH1_DERIVE_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<CK_ECDH1_DERIVE_PARAMS>(),
        8usize,
        concat!("Alignment of ", stringify!(CK_ECDH1_DERIVE_PARAMS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_ECDH1_DERIVE_PARAMS>())).kdf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_ECDH1_DERIVE_PARAMS),
            "::",
            stringify!(kdf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CK_ECDH1_DERIVE_PARAMS>())).ulSharedDataLen as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_ECDH1_DERIVE_PARAMS),
            "::",
            stringify!(ulSharedDataLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_ECDH1_DERIVE_PARAMS>())).pSharedData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_ECDH1_DERIVE_PARAMS),
            "::",
            stringify!(pSharedData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CK_ECDH1_DERIVE_PARAMS>())).ulPublicDataLen as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_ECDH1_DERIVE_PARAMS),
            "::",
            stringify!(ulPublicDataLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_ECDH1_DERIVE_PARAMS>())).pPublicData as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_ECDH1_DERIVE_PARAMS),
            "::",
            stringify!(pPublicData)
        )
    );
}
pub type CK_RSA_PKCS_MGF_TYPE = ::std::os::raw::c_ulong;
pub type CK_RSA_PKCS_OAEP_SOURCE_TYPE = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_RSA_PKCS_OAEP_PARAMS {
    pub hashAlg: CK_MECHANISM_TYPE,
    pub mgf: CK_RSA_PKCS_MGF_TYPE,
    pub source: CK_RSA_PKCS_OAEP_SOURCE_TYPE,
    pub pSourceData: *mut ::std::os::raw::c_void,
    pub ulSourceDataLen: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_CK_RSA_PKCS_OAEP_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<CK_RSA_PKCS_OAEP_PARAMS>(),
        40usize,
        concat!("Size of: ", stringify!(CK_RSA_PKCS_OAEP_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<CK_RSA_PKCS_OAEP_PARAMS>(),
        8usize,
        concat!("Alignment of ", stringify!(CK_RSA_PKCS_OAEP_PARAMS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_OAEP_PARAMS>())).hashAlg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_OAEP_PARAMS),
            "::",
            stringify!(hashAlg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_OAEP_PARAMS>())).mgf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_OAEP_PARAMS),
            "::",
            stringify!(mgf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_OAEP_PARAMS>())).source as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_OAEP_PARAMS),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_OAEP_PARAMS>())).pSourceData as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_OAEP_PARAMS),
            "::",
            stringify!(pSourceData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CK_RSA_PKCS_OAEP_PARAMS>())).ulSourceDataLen as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_OAEP_PARAMS),
            "::",
            stringify!(ulSourceDataLen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_RSA_PKCS_PSS_PARAMS {
    pub hashAlg: CK_MECHANISM_TYPE,
    pub mgf: CK_RSA_PKCS_MGF_TYPE,
    pub sLen: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_CK_RSA_PKCS_PSS_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<CK_RSA_PKCS_PSS_PARAMS>(),
        24usize,
        concat!("Size of: ", stringify!(CK_RSA_PKCS_PSS_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<CK_RSA_PKCS_PSS_PARAMS>(),
        8usize,
        concat!("Alignment of ", stringify!(CK_RSA_PKCS_PSS_PARAMS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_PSS_PARAMS>())).hashAlg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_PSS_PARAMS),
            "::",
            stringify!(hashAlg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_PSS_PARAMS>())).mgf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_PSS_PARAMS),
            "::",
            stringify!(mgf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CK_RSA_PKCS_PSS_PARAMS>())).sLen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CK_RSA_PKCS_PSS_PARAMS),
            "::",
            stringify!(sLen)
        )
    );
}
pub type CK_RV = ::std::os::raw::c_ulong;
pub type CK_NOTIFY =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             event: CK_NOTIFICATION,
                             application: *mut ::std::os::raw::c_void)
                             -> CK_RV,
    >;
pub type CK_C_Initialize =
    ::std::option::Option<extern "C" fn(init_args: *mut ::std::os::raw::c_void) -> CK_RV>;

#[derive(Debug, Copy, Clone)]
struct Slot {
    flags: CK_FLAGS,
}

#[derive(Debug, Copy, Clone)]
struct Session {
    slotID: CK_SLOT_ID,
    flags: CK_FLAGS
}

static mut G_FUNCTION_LIST: Option<CK_FUNCTION_LIST_PTR> = None;
static mut G_SLOTS: Option<HashMap<CK_SLOT_ID, Slot>> = None;
static mut G_SESSIONS: Option<HashMap<CK_SESSION_HANDLE, Session>> = None;

#[no_mangle]
pub extern "C" fn C_Initialize(_init_args: *mut ::std::os::raw::c_void) -> CK_RV {
    eprintln!("C_Initialize called");
    unsafe {
        G_SLOTS = Some(HashMap::new());
        G_SESSIONS = Some(HashMap::new());
        CKR_OK
    }.into()
}

pub type CK_C_Finalize =
    ::std::option::Option<extern "C" fn(pReserved: *mut ::std::os::raw::c_void) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_Finalize(_pReserved: *mut ::std::os::raw::c_void) -> CK_RV {
    eprintln!("C_Finalize called");
    unsafe {
        G_SLOTS = None;
        G_SESSIONS = None;
        CKR_OK
    }.into()
}

pub type CK_C_GetInfo = ::std::option::Option<unsafe extern "C" fn(info: *mut _CK_INFO) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_GetInfo(info_ptr: *mut _CK_INFO) -> CK_RV {
    eprintln!("C_GetInfo called");
    unsafe {
        match info_ptr.as_mut() {
            Some(info) => {
                info.cryptokiVersion.major = 2;
                info.cryptokiVersion.minor = 40;
                info.libraryVersion.major = 1;
                info.libraryVersion.minor = 0;
                info.flags = 0;
                info.libraryDescription.fill(65u8);
                info.manufacturerID.fill(66u8);
                eprintln!("C_GetInfo returning {:?}", info);
                CKR_OK
            },
            None => CKR_ARGUMENTS_BAD
        }
    }.into()
}

pub type CK_C_GetFunctionList =
    ::std::option::Option<
        unsafe extern "C" fn(function_list: *mut *mut _CK_FUNCTION_LIST) -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GetFunctionList(function_list: *mut *mut _CK_FUNCTION_LIST) -> CK_RV {
    unsafe {
        eprintln!("C_GetFunctionList called");
        if G_FUNCTION_LIST.is_none() {
            let fun = Box::new(CK_FUNCTION_LIST {
                version : CK_VERSION {major: 2, minor: 40},

                C_Initialize: Some(C_Initialize),
                C_Finalize: Some(C_Finalize),
                C_GetInfo: Some(C_GetInfo),
                C_GetFunctionList: Some(C_GetFunctionList),

                C_GetSlotList: Some(C_GetSlotList),
                C_GetSlotInfo: Some(C_GetSlotInfo),
                C_GetTokenInfo: Some(C_GetTokenInfo),

                C_GetMechanismList: Some(C_GetMechanismList),
                C_GetMechanismInfo: Some(C_GetMechanismInfo),

                C_InitToken: Some(C_InitToken),
                C_InitPIN: Some(C_InitPIN),
                C_SetPIN: Some(C_SetPIN),

                C_OpenSession: Some(C_OpenSession),
                C_CloseSession: Some(C_CloseSession),
                C_CloseAllSessions: Some(C_CloseAllSessions),
                C_GetSessionInfo: Some(C_GetSessionInfo),

                C_GetOperationState: None,
                C_SetOperationState: None,

                C_Login: Some(C_Login),
                C_Logout: Some(C_Logout),

                C_CreateObject: None,
                C_CopyObject: None,
                C_DestroyObject: None,
                C_GetObjectSize: None,

                C_GetAttributeValue: None,
                C_SetAttributeValue: None,

                C_FindObjectsInit: Some(C_FindObjectsInit),
                C_FindObjects: Some(C_FindObjects),
                C_FindObjectsFinal: Some(C_FindObjectsFinal),

                C_EncryptInit: None,
                C_Encrypt: None,
                C_EncryptUpdate: None,
                C_EncryptFinal: None,

                C_DecryptInit: None,
                C_Decrypt: None,
                C_DecryptUpdate: None,
                C_DecryptFinal: None,

                C_DigestInit: None,
                C_Digest: None,
                C_DigestUpdate: None,
                C_DigestKey: None,
                C_DigestFinal: None,

                C_SignInit: None,
                C_Sign: None,
                C_SignUpdate: None,
                C_SignFinal: None,
                C_SignRecoverInit: None,
                C_SignRecover: None,

                C_VerifyInit: None,
                C_Verify: None,
                C_VerifyUpdate: None,
                C_VerifyFinal: None,
                C_VerifyRecoverInit: None,
                C_VerifyRecover: None,

                C_DigestEncryptUpdate: None,
                C_DecryptDigestUpdate: None,
                C_SignEncryptUpdate: None,
                C_DecryptVerifyUpdate: None,

                C_GenerateKey: None,
                C_GenerateKeyPair: None,

                C_WrapKey: None,
                C_UnwrapKey: None,
                C_DeriveKey: None,

                C_SeedRandom: Some(C_SeedRandom),
                C_GenerateRandom: Some(C_GenerateRandom),

                C_GetFunctionStatus: Some(C_GetFunctionStatus),
                C_CancelFunction: Some(C_CancelFunction),
                C_WaitForSlotEvent: Some(C_WaitForSlotEvent),
            });
            eprintln!("C_GetFunctionList created {:?}", fun);
            G_FUNCTION_LIST = Some(Box::into_raw(fun));
        }
        match G_FUNCTION_LIST {
            Some(func_list) => {
                eprintln!("C_GetFunctionList returning {:?}", func_list);
                *function_list = func_list;
                CKR_OK
            },
            None => CKR_HOST_MEMORY
        }
    }.into()
}

pub type CK_C_GetSlotList =
    ::std::option::Option<
        unsafe extern "C" fn(token_present: ::std::os::raw::c_uchar,
                             slot_list: *mut CK_SLOT_ID,
                             count: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GetSlotList(
    token_present: ::std::os::raw::c_uchar,
    slot_list: *mut CK_SLOT_ID,
    count: *mut ::std::os::raw::c_ulong,
) -> CK_RV {
    unsafe {
        eprintln!("C_GetSlotList called with {:?}", (token_present, slot_list, *count));
        match G_SLOTS.as_mut() {
            Some(slots) => {
                if slots.is_empty() {
                    slots.insert(0, Slot {flags: (CKF_HW_SLOT | CKF_REMOVABLE_DEVICE) as CK_FLAGS} );
                    slots.insert(1, Slot {flags: (CKF_HW_SLOT | CKF_REMOVABLE_DEVICE | CKF_TOKEN_PRESENT) as CK_FLAGS});
                    slots.insert(2, Slot {flags: (CKF_HW_SLOT | CKF_REMOVABLE_DEVICE) as CK_FLAGS});
                    eprintln!("C_GetSlotList initialized {:?}", slots);
                }
                let keys = if token_present == 0 {
                    Vec::from_iter(slots.keys().map(|x| *x))
                } else {
                    Vec::from_iter(slots.iter().filter(|x| x.1.flags & (CKF_TOKEN_PRESENT as u64) != 0).map(|x| *x.0))
                };
                match slot_list.as_mut() {
                    Some(_) => {
                        if *count >= keys.len() as u64 {
                            ptr::copy(keys.as_ptr(), slot_list, keys.len());
                            *count = keys.len() as u64;
                            eprintln!("C_GetSlotList returning {:?}", keys);
                            CKR_OK
                        } else {
                            *count = keys.len() as u64;
                            eprintln!("C_GetSlotList returning {:?}", *count);
                            CKR_BUFFER_TOO_SMALL
                        }
                    },
                    None => {
                        *count = keys.len() as u64;
                        eprintln!("C_GetSlotList returning {:?}", *count);
                        CKR_OK
                    }
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_GetSlotInfo = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID,
                         info: *mut _CK_SLOT_INFO)
                         -> CK_RV,
>;

#[no_mangle]
pub extern "C" fn C_GetSlotInfo(slotID: CK_SLOT_ID, info_ptr: *mut _CK_SLOT_INFO) -> CK_RV {
    eprintln!("C_GetSlotInfo {} called", slotID);

    unsafe {
        match G_SLOTS.as_ref() {
            Some(slots) => {
                match slots.get(&slotID) {
                    Some(slot) => {
                        match info_ptr.as_mut() {
                            Some(info) => {
                                info.hardwareVersion.major = 1;
                                info.hardwareVersion.minor = 0;
                                info.firmwareVersion.major = 5;
                                info.firmwareVersion.minor = 43;
                                info.slotDescription.fill(65u8);
                                info.manufacturerID.fill(66u8);
                                info.flags = slot.flags;
                                eprintln!("C_GetSlotInfo returning {:?}", info);
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SLOT_ID_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_GetTokenInfo = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID,
                         info: *mut _CK_TOKEN_INFO)
                         -> CK_RV,
>;

#[no_mangle]
pub extern "C" fn C_GetTokenInfo(slotID: CK_SLOT_ID, info_ptr: *mut _CK_TOKEN_INFO) -> CK_RV {
    eprintln!("C_GetTokenInfo {} called", slotID);

    unsafe {
        match G_SLOTS.as_ref() {
            Some(slots) => {
                match slots.get(&slotID) {
                    Some(_slot) => {
                        match info_ptr.as_mut() {
                            Some(info) => {
                                info.label.fill(65u8);
                                info.manufacturerID.fill(66u8);
                                info.model.fill(67u8);
                                info.serialNumber.fill(0x30u8);
                                info.flags = (CKF_RNG | CKF_LOGIN_REQUIRED | CKF_USER_PIN_INITIALIZED | CKF_TOKEN_INITIALIZED) as u64;
                                info.ulMaxSessionCount = 0;
                                info.ulSessionCount = 0;
                                info.ulMaxRwSessionCount = 0;
                                info.ulRwSessionCount = 0;
                                info.ulMaxPinLen = 34;
                                info.ulMinPinLen = 4;
                                info.ulTotalPublicMemory = 0;
                                info.ulFreePublicMemory = 0;
                                info.ulTotalPrivateMemory = 0;
                                info.ulFreePrivateMemory = 0;
                                info.hardwareVersion.major = 5;
                                info.hardwareVersion.minor = 43;
                                info.firmwareVersion.major = 5;
                                info.firmwareVersion.minor = 43;
                                info.utcTime.fill(0u8);
                                eprintln!("C_GetTokenInfo returning {:?}", info);
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SLOT_ID_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_WaitForSlotEvent =
    ::std::option::Option<
        unsafe extern "C" fn(flags: CK_FLAGS,
                             slot: *mut CK_SLOT_ID,
                             pReserved: *mut ::std::os::raw::c_void)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_WaitForSlotEvent(
    _flags: CK_FLAGS,
    _slot: *mut CK_SLOT_ID,
    _pReserved: *mut ::std::os::raw::c_void,
) -> CK_RV {
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_GetMechanismList =
    ::std::option::Option<
        unsafe extern "C" fn(slotID: CK_SLOT_ID,
                             mechanism_list: *mut CK_MECHANISM_TYPE,
                             count: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GetMechanismList(
    slotID: CK_SLOT_ID,
    mechanism_list: *mut CK_MECHANISM_TYPE,
    count: *mut ::std::os::raw::c_ulong,
) -> CK_RV {
    unsafe {
        eprintln!("C_GetMechanismList called with {:?}", (slotID, mechanism_list, *count));
        match G_SLOTS.as_ref() {
            Some(slots) => {
                match slots.get(&slotID) {
                    Some(_slot) => {
                        match mechanism_list.as_mut() {
                            Some(_) => {
                                let list = slice::from_raw_parts_mut(mechanism_list, *count as usize);
                                for i in 0..*count {
                                    list[i as usize] = i;
                                }
                                eprintln!("C_GetMechanismList returning {:?}", list);
                                CKR_OK
                            },
                            None => {
                                eprintln!("C_GetMechanismList returning {:?}", 7);
                                *count = 7;
                                CKR_OK
                            }
                        }
                    }
                    None => CKR_SLOT_ID_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_GetMechanismInfo =
    ::std::option::Option<
        unsafe extern "C" fn(slotID: CK_SLOT_ID,
                             type_: CK_MECHANISM_TYPE,
                             info: *mut _CK_MECHANISM_INFO)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GetMechanismInfo(
    slotID: CK_SLOT_ID,
    type_: CK_MECHANISM_TYPE,
    info_ptr: *mut _CK_MECHANISM_INFO,
) -> CK_RV {
    eprintln!("C_GetMechanismInfo called with {:?}", (slotID, type_, info_ptr));
    unsafe {
        match G_SLOTS.as_ref() {
            Some(slots) => {
                match slots.get(&slotID) {
                    Some(_slot) => {
                        match info_ptr.as_mut() {
                            Some(info) => {
                                info.ulMinKeySize = 128;
                                info.ulMaxKeySize = 256;
                                info.flags = 0;
                                eprintln!("C_GetMechanismInfo returning {:?}", info);
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SLOT_ID_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_InitToken =
    ::std::option::Option<
        unsafe extern "C" fn(slotID: CK_SLOT_ID,
                             pin: *mut ::std::os::raw::c_uchar,
                             pin_len: ::std::os::raw::c_ulong,
                             label: *mut ::std::os::raw::c_uchar)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_InitToken(
    _slotID: CK_SLOT_ID,
    _pin: *mut ::std::os::raw::c_uchar,
    _pin_len: ::std::os::raw::c_ulong,
    _label: *mut ::std::os::raw::c_uchar,
) -> CK_RV {
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_InitPIN =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             pin: *mut ::std::os::raw::c_uchar,
                             pin_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_InitPIN(
    _session: CK_SESSION_HANDLE,
    _pin: *mut ::std::os::raw::c_uchar,
    _pin_len: ::std::os::raw::c_ulong,
) -> CK_RV {
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_SetPIN =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             old_pin: *mut ::std::os::raw::c_uchar,
                             old_len: ::std::os::raw::c_ulong,
                             new_pin: *mut ::std::os::raw::c_uchar,
                             new_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_SetPIN(
    _session: CK_SESSION_HANDLE,
    _old_pin: *mut ::std::os::raw::c_uchar,
    _old_len: ::std::os::raw::c_ulong,
    _new_pin: *mut ::std::os::raw::c_uchar,
    _new_len: ::std::os::raw::c_ulong,
) -> CK_RV {
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_OpenSession =
    ::std::option::Option<
        unsafe extern "C" fn(slotID: CK_SLOT_ID,
                             flags: CK_FLAGS,
                             application: *mut ::std::os::raw::c_void,
                             notify: CK_NOTIFY,
                             session: *mut CK_SESSION_HANDLE)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_OpenSession(
    slotID: CK_SLOT_ID,
    flags: CK_FLAGS,
    _application: *mut ::std::os::raw::c_void,
    _notify: CK_NOTIFY,
    session: *mut CK_SESSION_HANDLE,
) -> CK_RV {
    eprintln!("C_OpenSession called with {:?}", (slotID, flags));
    unsafe {
        match G_SLOTS.as_ref() {
            Some(slots) => {
                match slots.get(&slotID) {
                    Some(_slot) => {
                        match G_SESSIONS.as_mut() {
                            Some(sessions) => {
                                let k = match sessions.keys().max() {
                                    Some(v) => v + 1,
                                    None => 1
                                };
                                eprintln!("C_OpenSession sessions before {:?}", sessions);
                                sessions.insert(k, Session {slotID, flags});
                                eprintln!("C_OpenSession sessions after {:?}", sessions);
                                eprintln!("C_OpenSession returning {:?}", k);
                                *session = k;
                                CKR_OK
                            },
                            None => CKR_HOST_MEMORY
                        }
                    }
                    None => CKR_SLOT_ID_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_CloseSession =
    ::std::option::Option<unsafe extern "C" fn(session: CK_SESSION_HANDLE) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_CloseSession(session_handle: CK_SESSION_HANDLE) -> CK_RV {
    eprintln!("C_CloseSession called with {:?}", session_handle);
    unsafe {
        match G_SESSIONS.as_mut() {
            Some(sessions) => {
                eprintln!("C_CloseSession sessions before {:?}", sessions);
                match sessions.remove(&session_handle) {
                    Some(session) => {
                        eprintln!("C_CloseSession removed {:?}", (session_handle, session));
                        eprintln!("C_CloseSession sessions after {:?}", sessions);
                        CKR_OK
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_CloseAllSessions = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID)
                         -> CK_RV,
>;

#[no_mangle]
pub extern "C" fn C_CloseAllSessions(slotID: CK_SLOT_ID) -> CK_RV {
    eprintln!("C_CloseAllSessions called with {:?}", slotID);
    unsafe {
        match G_SESSIONS.as_mut() {
            Some(sessions) => {
                eprintln!("C_CloseAllSessions sessions before {:?}", sessions);
                sessions.retain(|_k, v| v.slotID != slotID);
                eprintln!("C_CloseAllSessions sessions after {:?}", sessions);
                CKR_OK
            }
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_GetSessionInfo =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             info: *mut _CK_SESSION_INFO)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GetSessionInfo(session_handle: CK_SESSION_HANDLE, info_ptr: *mut _CK_SESSION_INFO) -> CK_RV {
    eprintln!("C_GetSessionInfo called with {:?}", session_handle);
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(session) => {
                        match info_ptr.as_mut() {
                            Some(info) => { 
                                info.slotID = session.slotID;
                                info.state = CKS_RW_PUBLIC_SESSION as u64;
                                info.flags = session.flags;
                                info.ulDeviceError = 0;
                                eprintln!("C_GetSessionInfo returning {:?}", info);
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_GetOperationState =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             operation_state: *mut ::std::os::raw::c_uchar,
                             operation_state_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_GetOperationState(
        session: CK_SESSION_HANDLE,
        operation_state: *mut ::std::os::raw::c_uchar,
        operation_state_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SetOperationState =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             operation_state: *mut ::std::os::raw::c_uchar,
                             operation_state_len: ::std::os::raw::c_ulong,
                             encryption_key: CK_OBJECT_HANDLE,
                             authentiation_key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SetOperationState(
        session: CK_SESSION_HANDLE,
        operation_state: *mut ::std::os::raw::c_uchar,
        operation_state_len: ::std::os::raw::c_ulong,
        encryption_key: CK_OBJECT_HANDLE,
        authentiation_key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_Login =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             user_type: CK_USER_TYPE,
                             pin: *mut ::std::os::raw::c_uchar,
                             pin_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_Login(
    session_handle: CK_SESSION_HANDLE,
    user_type: CK_USER_TYPE,
    pin: *mut ::std::os::raw::c_uchar,
    pin_len: ::std::os::raw::c_ulong,
) -> CK_RV {
    eprintln!("C_Login called with {:?}", (session_handle, user_type, pin, pin_len));
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(_session) => {
                        match pin.as_ref() {
                            Some(_pin) => { 
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_Logout = ::std::option::Option<
    unsafe extern "C" fn(session: CK_SESSION_HANDLE)
                         -> CK_RV,
>;
    
#[no_mangle]
pub extern "C" fn C_Logout(session_handle: CK_SESSION_HANDLE) -> CK_RV {
    eprintln!("C_Logout called with {:?}", session_handle);
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(_session) => {
                        CKR_OK
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_CreateObject =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong,
                             object: *mut CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_CreateObject(
        session: CK_SESSION_HANDLE,
        templ: *mut _CK_ATTRIBUTE,
        count: ::std::os::raw::c_ulong,
        object: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_CopyObject =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: CK_OBJECT_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong,
                             new_object: *mut CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_CopyObject(
        session: CK_SESSION_HANDLE,
        object: CK_OBJECT_HANDLE,
        templ: *mut _CK_ATTRIBUTE,
        count: ::std::os::raw::c_ulong,
        new_object: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_DestroyObject =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DestroyObject(session: CK_SESSION_HANDLE, object: CK_OBJECT_HANDLE) -> CK_RV;
}
pub type CK_C_GetObjectSize =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: CK_OBJECT_HANDLE,
                             size: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_GetObjectSize(
        session: CK_SESSION_HANDLE,
        object: CK_OBJECT_HANDLE,
        size: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_GetAttributeValue =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: CK_OBJECT_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_GetAttributeValue(
        session: CK_SESSION_HANDLE,
        object: CK_OBJECT_HANDLE,
        templ: *mut _CK_ATTRIBUTE,
        count: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SetAttributeValue =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: CK_OBJECT_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SetAttributeValue(
        session: CK_SESSION_HANDLE,
        object: CK_OBJECT_HANDLE,
        templ: *mut _CK_ATTRIBUTE,
        count: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_FindObjectsInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_FindObjectsInit(
    session_handle: CK_SESSION_HANDLE,
    templ: *mut _CK_ATTRIBUTE,
    count: ::std::os::raw::c_ulong,
) -> CK_RV {
    eprintln!("C_FindObjectsInit called with {:?}", (session_handle, templ, count));
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(_session) => {
                        match templ.as_ref() {
                            Some(_info) => { 
                                CKR_OK
                            },
                            None => {
                                CKR_OK
                            }
                        }
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_FindObjects =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             object: *mut CK_OBJECT_HANDLE,
                             max_object_count: ::std::os::raw::c_ulong,
                             object_count: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_FindObjects(
    session_handle: CK_SESSION_HANDLE,
    object: *mut CK_OBJECT_HANDLE,
    max_object_count: ::std::os::raw::c_ulong,
    object_count: *mut ::std::os::raw::c_ulong,
) -> CK_RV {
    eprintln!("C_FindObjects called with {:?}", (session_handle, object, max_object_count, object_count));
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(_session) => {
                        match object.as_mut() {
                            Some(_info) => {
                                eprintln!("C_FindObjects returning {:?}", 0);
                                *object_count = 0;
                                CKR_OK
                            },
                            None => CKR_ARGUMENTS_BAD
                        }
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_FindObjectsFinal =
    ::std::option::Option<unsafe extern "C" fn(session: CK_SESSION_HANDLE) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_FindObjectsFinal(session_handle: CK_SESSION_HANDLE) -> CK_RV {
    eprintln!("C_FindObjectsFinal called with {:?}", session_handle);
    unsafe {
        match G_SESSIONS.as_ref() {
            Some(sessions) => {
                match sessions.get(&session_handle) {
                    Some(_session) => {
                        CKR_OK
                    }
                    None => CKR_SESSION_HANDLE_INVALID
                }
            },
            None => CKR_CRYPTOKI_NOT_INITIALIZED
        }
    }.into()
}

pub type CK_C_EncryptInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_EncryptInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_Encrypt =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: ::std::os::raw::c_ulong,
                             encrypted_data: *mut ::std::os::raw::c_uchar,
                             encrypted_data_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_Encrypt(
        session: CK_SESSION_HANDLE,
        data: *mut ::std::os::raw::c_uchar,
        data_len: ::std::os::raw::c_ulong,
        encrypted_data: *mut ::std::os::raw::c_uchar,
        encrypted_data_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_EncryptUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_EncryptUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_EncryptFinal = :: std :: option :: Option < unsafe extern "C" fn (session : CK_SESSION_HANDLE , last_encrypted_part : * mut :: std :: os :: raw :: c_uchar , last_encrypted_part_len : * mut :: std :: os :: raw :: c_ulong) -> CK_RV > ;
extern "C" {
    pub fn C_EncryptFinal(
        session: CK_SESSION_HANDLE,
        last_encrypted_part: *mut ::std::os::raw::c_uchar,
        last_encrypted_part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DecryptInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DecryptInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_Decrypt =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             encrypted_data: *mut ::std::os::raw::c_uchar,
                             encrypted_data_len: ::std::os::raw::c_ulong,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_Decrypt(
        session: CK_SESSION_HANDLE,
        encrypted_data: *mut ::std::os::raw::c_uchar,
        encrypted_data_len: ::std::os::raw::c_ulong,
        data: *mut ::std::os::raw::c_uchar,
        data_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DecryptUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: ::std::os::raw::c_ulong,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DecryptUpdate(
        session: CK_SESSION_HANDLE,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: ::std::os::raw::c_ulong,
        part: *mut ::std::os::raw::c_uchar,
        part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DecryptFinal =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             last_part: *mut ::std::os::raw::c_uchar,
                             last_part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DecryptFinal(
        session: CK_SESSION_HANDLE,
        last_part: *mut ::std::os::raw::c_uchar,
        last_part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DigestInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DigestInit(session: CK_SESSION_HANDLE, mechanism: *mut _CK_MECHANISM) -> CK_RV;
}
pub type CK_C_Digest =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: ::std::os::raw::c_ulong,
                             digest: *mut ::std::os::raw::c_uchar,
                             digest_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_Digest(
        session: CK_SESSION_HANDLE,
        data: *mut ::std::os::raw::c_uchar,
        data_len: ::std::os::raw::c_ulong,
        digest: *mut ::std::os::raw::c_uchar,
        digest_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DigestUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DigestUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DigestKey = ::std::option::Option<
    unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                         key: CK_OBJECT_HANDLE)
                         -> CK_RV,
>;
extern "C" {
    pub fn C_DigestKey(session: CK_SESSION_HANDLE, key: CK_OBJECT_HANDLE) -> CK_RV;
}
pub type CK_C_DigestFinal =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             digest: *mut ::std::os::raw::c_uchar,
                             digest_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DigestFinal(
        session: CK_SESSION_HANDLE,
        digest: *mut ::std::os::raw::c_uchar,
        digest_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SignInit = ::std::option::Option<
    unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                         mechanism: *mut _CK_MECHANISM,
                         key: CK_OBJECT_HANDLE)
                         -> CK_RV,
>;
extern "C" {
    pub fn C_SignInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_Sign =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: ::std::os::raw::c_ulong,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_Sign(
        session: CK_SESSION_HANDLE,
        data: *mut ::std::os::raw::c_uchar,
        data_len: ::std::os::raw::c_ulong,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SignUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SignUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SignFinal =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SignFinal(
        session: CK_SESSION_HANDLE,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SignRecoverInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SignRecoverInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_SignRecover =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: ::std::os::raw::c_ulong,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SignRecover(
        session: CK_SESSION_HANDLE,
        data: *mut ::std::os::raw::c_uchar,
        data_len: ::std::os::raw::c_ulong,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_VerifyInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_VerifyInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_Verify =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: ::std::os::raw::c_ulong,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_Verify(
        session: CK_SESSION_HANDLE,
        data: *mut ::std::os::raw::c_uchar,
        data_len: ::std::os::raw::c_ulong,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_VerifyUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_VerifyUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_VerifyFinal =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_VerifyFinal(
        session: CK_SESSION_HANDLE,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_VerifyRecoverInit =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             key: CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_VerifyRecoverInit(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        key: CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_VerifyRecover =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             signature: *mut ::std::os::raw::c_uchar,
                             signature_len: ::std::os::raw::c_ulong,
                             data: *mut ::std::os::raw::c_uchar,
                             data_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_VerifyRecover(
        session: CK_SESSION_HANDLE,
        signature: *mut ::std::os::raw::c_uchar,
        signature_len: ::std::os::raw::c_ulong,
        data: *mut ::std::os::raw::c_uchar,
        data_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DigestEncryptUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DigestEncryptUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DecryptDigestUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: ::std::os::raw::c_ulong,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DecryptDigestUpdate(
        session: CK_SESSION_HANDLE,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: ::std::os::raw::c_ulong,
        part: *mut ::std::os::raw::c_uchar,
        part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_SignEncryptUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: ::std::os::raw::c_ulong,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_SignEncryptUpdate(
        session: CK_SESSION_HANDLE,
        part: *mut ::std::os::raw::c_uchar,
        part_len: ::std::os::raw::c_ulong,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_DecryptVerifyUpdate =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             encrypted_part: *mut ::std::os::raw::c_uchar,
                             encrypted_part_len: ::std::os::raw::c_ulong,
                             part: *mut ::std::os::raw::c_uchar,
                             part_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DecryptVerifyUpdate(
        session: CK_SESSION_HANDLE,
        encrypted_part: *mut ::std::os::raw::c_uchar,
        encrypted_part_len: ::std::os::raw::c_ulong,
        part: *mut ::std::os::raw::c_uchar,
        part_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_GenerateKey =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             templ: *mut _CK_ATTRIBUTE,
                             count: ::std::os::raw::c_ulong,
                             key: *mut CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_GenerateKey(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        templ: *mut _CK_ATTRIBUTE,
        count: ::std::os::raw::c_ulong,
        key: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_GenerateKeyPair = :: std :: option :: Option < unsafe extern "C" fn (session : CK_SESSION_HANDLE , mechanism : * mut _CK_MECHANISM , public_key_template : * mut _CK_ATTRIBUTE , public_key_attribute_count : :: std :: os :: raw :: c_ulong , private_key_template : * mut _CK_ATTRIBUTE , private_key_attribute_count : :: std :: os :: raw :: c_ulong , public_key : * mut CK_OBJECT_HANDLE , private_key : * mut CK_OBJECT_HANDLE) -> CK_RV > ;
extern "C" {
    pub fn C_GenerateKeyPair(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        public_key_template: *mut _CK_ATTRIBUTE,
        public_key_attribute_count: ::std::os::raw::c_ulong,
        private_key_template: *mut _CK_ATTRIBUTE,
        private_key_attribute_count: ::std::os::raw::c_ulong,
        public_key: *mut CK_OBJECT_HANDLE,
        private_key: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_WrapKey =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             wrapping_key: CK_OBJECT_HANDLE,
                             key: CK_OBJECT_HANDLE,
                             wrapped_key: *mut ::std::os::raw::c_uchar,
                             wrapped_key_len: *mut ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_WrapKey(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        wrapping_key: CK_OBJECT_HANDLE,
        key: CK_OBJECT_HANDLE,
        wrapped_key: *mut ::std::os::raw::c_uchar,
        wrapped_key_len: *mut ::std::os::raw::c_ulong,
    ) -> CK_RV;
}
pub type CK_C_UnwrapKey =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             unwrapping_key: CK_OBJECT_HANDLE,
                             wrapped_key: *mut ::std::os::raw::c_uchar,
                             wrapped_key_len: ::std::os::raw::c_ulong,
                             templ: *mut _CK_ATTRIBUTE,
                             attribute_count: ::std::os::raw::c_ulong,
                             key: *mut CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_UnwrapKey(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        unwrapping_key: CK_OBJECT_HANDLE,
        wrapped_key: *mut ::std::os::raw::c_uchar,
        wrapped_key_len: ::std::os::raw::c_ulong,
        templ: *mut _CK_ATTRIBUTE,
        attribute_count: ::std::os::raw::c_ulong,
        key: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_DeriveKey =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             mechanism: *mut _CK_MECHANISM,
                             base_key: CK_OBJECT_HANDLE,
                             templ: *mut _CK_ATTRIBUTE,
                             attribute_count: ::std::os::raw::c_ulong,
                             key: *mut CK_OBJECT_HANDLE)
                             -> CK_RV,
    >;
extern "C" {
    pub fn C_DeriveKey(
        session: CK_SESSION_HANDLE,
        mechanism: *mut _CK_MECHANISM,
        base_key: CK_OBJECT_HANDLE,
        templ: *mut _CK_ATTRIBUTE,
        attribute_count: ::std::os::raw::c_ulong,
        key: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV;
}
pub type CK_C_SeedRandom =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             seed: *mut ::std::os::raw::c_uchar,
                             seed_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_SeedRandom(
    _session: CK_SESSION_HANDLE,
    _seed: *mut ::std::os::raw::c_uchar,
    _seed_len: ::std::os::raw::c_ulong,
) -> CK_RV {
    eprintln!("C_SeedRandom called");
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_GenerateRandom =
    ::std::option::Option<
        unsafe extern "C" fn(session: CK_SESSION_HANDLE,
                             random_data: *mut ::std::os::raw::c_uchar,
                             random_len: ::std::os::raw::c_ulong)
                             -> CK_RV,
    >;

#[no_mangle]
pub extern "C" fn C_GenerateRandom(
    _session: CK_SESSION_HANDLE,
    _random_data: *mut ::std::os::raw::c_uchar,
    _random_len: ::std::os::raw::c_ulong,
) -> CK_RV {
    eprintln!("C_GenerateRandom called");
    CKR_OK.into()
}

pub type CK_C_GetFunctionStatus =
    ::std::option::Option<unsafe extern "C" fn(session: CK_SESSION_HANDLE) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_GetFunctionStatus(session: CK_SESSION_HANDLE) -> CK_RV {
    eprintln!("C_GetFunctionStatus called with {:?}", session);
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

pub type CK_C_CancelFunction =
    ::std::option::Option<unsafe extern "C" fn(session: CK_SESSION_HANDLE) -> CK_RV>;

#[no_mangle]
pub extern "C" fn C_CancelFunction(session: CK_SESSION_HANDLE) -> CK_RV {
    eprintln!("C_CancelFunction called with {:?}", session);
    CKR_FUNCTION_NOT_SUPPORTED.into()
}

#[repr(C)]
#[derive(Debug, Copy, Clone, Default)]
pub struct _CK_FUNCTION_LIST {
    pub version: _CK_VERSION,
    pub C_Initialize: CK_C_Initialize,
    pub C_Finalize: CK_C_Finalize,
    pub C_GetInfo: CK_C_GetInfo,
    pub C_GetFunctionList: CK_C_GetFunctionList,
    pub C_GetSlotList: CK_C_GetSlotList,
    pub C_GetSlotInfo: CK_C_GetSlotInfo,
    pub C_GetTokenInfo: CK_C_GetTokenInfo,
    pub C_GetMechanismList: CK_C_GetMechanismList,
    pub C_GetMechanismInfo: CK_C_GetMechanismInfo,
    pub C_InitToken: CK_C_InitToken,
    pub C_InitPIN: CK_C_InitPIN,
    pub C_SetPIN: CK_C_SetPIN,
    pub C_OpenSession: CK_C_OpenSession,
    pub C_CloseSession: CK_C_CloseSession,
    pub C_CloseAllSessions: CK_C_CloseAllSessions,
    pub C_GetSessionInfo: CK_C_GetSessionInfo,
    pub C_GetOperationState: CK_C_GetOperationState,
    pub C_SetOperationState: CK_C_SetOperationState,
    pub C_Login: CK_C_Login,
    pub C_Logout: CK_C_Logout,
    pub C_CreateObject: CK_C_CreateObject,
    pub C_CopyObject: CK_C_CopyObject,
    pub C_DestroyObject: CK_C_DestroyObject,
    pub C_GetObjectSize: CK_C_GetObjectSize,
    pub C_GetAttributeValue: CK_C_GetAttributeValue,
    pub C_SetAttributeValue: CK_C_SetAttributeValue,
    pub C_FindObjectsInit: CK_C_FindObjectsInit,
    pub C_FindObjects: CK_C_FindObjects,
    pub C_FindObjectsFinal: CK_C_FindObjectsFinal,
    pub C_EncryptInit: CK_C_EncryptInit,
    pub C_Encrypt: CK_C_Encrypt,
    pub C_EncryptUpdate: CK_C_EncryptUpdate,
    pub C_EncryptFinal: CK_C_EncryptFinal,
    pub C_DecryptInit: CK_C_DecryptInit,
    pub C_Decrypt: CK_C_Decrypt,
    pub C_DecryptUpdate: CK_C_DecryptUpdate,
    pub C_DecryptFinal: CK_C_DecryptFinal,
    pub C_DigestInit: CK_C_DigestInit,
    pub C_Digest: CK_C_Digest,
    pub C_DigestUpdate: CK_C_DigestUpdate,
    pub C_DigestKey: CK_C_DigestKey,
    pub C_DigestFinal: CK_C_DigestFinal,
    pub C_SignInit: CK_C_SignInit,
    pub C_Sign: CK_C_Sign,
    pub C_SignUpdate: CK_C_SignUpdate,
    pub C_SignFinal: CK_C_SignFinal,
    pub C_SignRecoverInit: CK_C_SignRecoverInit,
    pub C_SignRecover: CK_C_SignRecover,
    pub C_VerifyInit: CK_C_VerifyInit,
    pub C_Verify: CK_C_Verify,
    pub C_VerifyUpdate: CK_C_VerifyUpdate,
    pub C_VerifyFinal: CK_C_VerifyFinal,
    pub C_VerifyRecoverInit: CK_C_VerifyRecoverInit,
    pub C_VerifyRecover: CK_C_VerifyRecover,
    pub C_DigestEncryptUpdate: CK_C_DigestEncryptUpdate,
    pub C_DecryptDigestUpdate: CK_C_DecryptDigestUpdate,
    pub C_SignEncryptUpdate: CK_C_SignEncryptUpdate,
    pub C_DecryptVerifyUpdate: CK_C_DecryptVerifyUpdate,
    pub C_GenerateKey: CK_C_GenerateKey,
    pub C_GenerateKeyPair: CK_C_GenerateKeyPair,
    pub C_WrapKey: CK_C_WrapKey,
    pub C_UnwrapKey: CK_C_UnwrapKey,
    pub C_DeriveKey: CK_C_DeriveKey,
    pub C_SeedRandom: CK_C_SeedRandom,
    pub C_GenerateRandom: CK_C_GenerateRandom,
    pub C_GetFunctionStatus: CK_C_GetFunctionStatus,
    pub C_CancelFunction: CK_C_CancelFunction,
    pub C_WaitForSlotEvent: CK_C_WaitForSlotEvent,
}
#[test]
fn bindgen_test_layout__CK_FUNCTION_LIST() {
    assert_eq!(
        ::std::mem::size_of::<_CK_FUNCTION_LIST>(),
        552usize,
        concat!("Size of: ", stringify!(_CK_FUNCTION_LIST))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_FUNCTION_LIST>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_FUNCTION_LIST))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Initialize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Initialize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Finalize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Finalize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetInfo as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetFunctionList as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetFunctionList)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetSlotList as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetSlotList)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetSlotInfo as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetSlotInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetTokenInfo as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetTokenInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetMechanismList as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetMechanismList)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetMechanismInfo as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetMechanismInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_InitToken as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_InitToken)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_InitPIN as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_InitPIN)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SetPIN as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SetPIN)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_OpenSession as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_OpenSession)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_CloseSession as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_CloseSession)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_CloseAllSessions as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_CloseAllSessions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetSessionInfo as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetSessionInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetOperationState as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetOperationState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SetOperationState as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SetOperationState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Login as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Logout as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Logout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_CreateObject as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_CreateObject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_CopyObject as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_CopyObject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DestroyObject as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DestroyObject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetObjectSize as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetObjectSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetAttributeValue as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetAttributeValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SetAttributeValue as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SetAttributeValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_FindObjectsInit as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_FindObjectsInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_FindObjects as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_FindObjects)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_FindObjectsFinal as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_FindObjectsFinal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_EncryptInit as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_EncryptInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Encrypt as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Encrypt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_EncryptUpdate as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_EncryptUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_EncryptFinal as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_EncryptFinal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DecryptInit as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DecryptInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Decrypt as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Decrypt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DecryptUpdate as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DecryptUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DecryptFinal as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DecryptFinal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DigestInit as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DigestInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Digest as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Digest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DigestUpdate as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DigestUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DigestKey as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DigestKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DigestFinal as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DigestFinal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignInit as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Sign as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Sign)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignUpdate as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignFinal as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignFinal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignRecoverInit as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignRecoverInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignRecover as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignRecover)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_VerifyInit as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_VerifyInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_Verify as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_Verify)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_VerifyUpdate as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_VerifyUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_VerifyFinal as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_VerifyFinal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_VerifyRecoverInit as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_VerifyRecoverInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_VerifyRecover as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_VerifyRecover)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DigestEncryptUpdate as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DigestEncryptUpdate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DecryptDigestUpdate as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DecryptDigestUpdate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SignEncryptUpdate as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SignEncryptUpdate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DecryptVerifyUpdate as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DecryptVerifyUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GenerateKey as *const _ as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GenerateKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GenerateKeyPair as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GenerateKeyPair)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_WrapKey as *const _ as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_WrapKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_UnwrapKey as *const _ as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_UnwrapKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_DeriveKey as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_DeriveKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_SeedRandom as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_SeedRandom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GenerateRandom as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GenerateRandom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_GetFunctionStatus as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_GetFunctionStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_CancelFunction as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_CancelFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_FUNCTION_LIST>())).C_WaitForSlotEvent as *const _ as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_FUNCTION_LIST),
            "::",
            stringify!(C_WaitForSlotEvent)
        )
    );
}
pub type CK_CREATEMUTEX =
    ::std::option::Option<unsafe extern "C" fn(mutex: *mut *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_DESTROYMUTEX =
    ::std::option::Option<unsafe extern "C" fn(mutex: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_LOCKMUTEX =
    ::std::option::Option<unsafe extern "C" fn(mutex: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_UNLOCKMUTEX =
    ::std::option::Option<unsafe extern "C" fn(mutex: *mut ::std::os::raw::c_void) -> CK_RV>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CK_C_INITIALIZE_ARGS {
    pub pfnCreateMutex: CK_CREATEMUTEX,
    pub pfnDestroyMutex: CK_DESTROYMUTEX,
    pub pfnLockMutex: CK_LOCKMUTEX,
    pub pfnUnlockMutex: CK_UNLOCKMUTEX,
    pub flags: CK_FLAGS,
    pub pReserved: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__CK_C_INITIALIZE_ARGS() {
    assert_eq!(
        ::std::mem::size_of::<_CK_C_INITIALIZE_ARGS>(),
        48usize,
        concat!("Size of: ", stringify!(_CK_C_INITIALIZE_ARGS))
    );
    assert_eq!(
        ::std::mem::align_of::<_CK_C_INITIALIZE_ARGS>(),
        8usize,
        concat!("Alignment of ", stringify!(_CK_C_INITIALIZE_ARGS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).pfnCreateMutex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(pfnCreateMutex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).pfnDestroyMutex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(pfnDestroyMutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).pfnLockMutex as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(pfnLockMutex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).pfnUnlockMutex as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(pfnUnlockMutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CK_C_INITIALIZE_ARGS>())).pReserved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_CK_C_INITIALIZE_ARGS),
            "::",
            stringify!(pReserved)
        )
    );
}
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = u128;
pub type CK_BYTE = ::std::os::raw::c_uchar;
pub type CK_CHAR = ::std::os::raw::c_uchar;
pub type CK_UTF8CHAR = ::std::os::raw::c_uchar;
pub type CK_BBOOL = ::std::os::raw::c_uchar;
pub type CK_ULONG = ::std::os::raw::c_ulong;
pub type CK_LONG = ::std::os::raw::c_long;
pub type CK_BYTE_PTR = *mut CK_BYTE;
pub type CK_CHAR_PTR = *mut CK_CHAR;
pub type CK_UTF8CHAR_PTR = *mut CK_UTF8CHAR;
pub type CK_ULONG_PTR = *mut CK_ULONG;
pub type CK_VOID_PTR = *mut ::std::os::raw::c_void;
pub type CK_VOID_PTR_PTR = *mut *mut ::std::os::raw::c_void;
pub type CK_VERSION = _CK_VERSION;
pub type CK_VERSION_PTR = *mut _CK_VERSION;
pub type CK_INFO = _CK_INFO;
pub type CK_INFO_PTR = *mut _CK_INFO;
pub type CK_SLOT_ID_PTR = *mut CK_SLOT_ID;
